---
type: ConicalFace
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ConicalFace

`Autodesk.Revit.DB.ConicalFace` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Method | Triangulate | — | `` |
| Property | Axis | — | `public XYZ Axis { get ; }` |
| Property | HalfAngle | — | `public double HalfAngle { get ; }` |
| Property | Origin | — | `public XYZ Origin { get ; }` |
| Property | Radius | — | `public XYZ this [ int index ] { get ; }` |